Repository: RickStrahl/Westwind.Globalization
Catalog: src/NetCore/WestWind.Globalization.Sample.AspNetCore/Properties/LocalizationForm.*.resx
Languages: de

source: Add
de: Hinzufügen

source: All Resource Sets
de: Alle RessourceSets

source: Are you sure you want to delete this resource?
de: Sind Sie sicher, dass Sie diese Ressource löschen wollen?

source: Are you sure you want to do this?
de: Sind Sie sicher, dass Sie dies tun wollen?

source: Backup
de: Sicherungskopie

# Backup.Title
source: Backup resources to a backup table in the database.
de: Backup Ressourcen zu einer SicherungsTabelle in der Datenbank.

# BackupComplete
source: Backup is complete.
de: Backup wurde durchgeführt.

# BackupFailed
source: The backup failed.
de: Backup wurde nicht durchgeführt

source: Cancel
de: Abbrechen

source: Comment
de: Kommentar

# CreateClass
source: Create Classes
de: Klassen erstellen

# CreateClass.Title
source: Create strongly typed classes from database resources.
de: Erstellt stark typisierte Klassen von Datenbank Ressourcen.

# CreateClassInfo
source: You can export your ResourceSets as strongly typed classes for easier access in your application. Each ResourceSet is transformed into a class with properties for each resource Id. Below you can specify the filename and a namespace for the generated class.
de: Sie können Ihre ResourceSets als stark typisierte Klassen exportieren. Jeder ResourceSet wird als eine Klasse mit Properties für jede Resource ID exportier. Hier können Sie den Dateinamen und einen Namespace für die generierten Klassen angeben.

source: Create Strongly Typed Classes
de: Erstellung von Stark typisierten Klassen

source: Create Table
de: Tabelle erstellen

# CreateTable.Title
source: Create the Localization table as defined in the configuration file.
de: Neue Tabelle erstellen, wie definiert in der Konfigurationsdatei.

source: Delete
de: Löschen

# Delete.ResourceSet.Title
source: Delete all resources in this ResourceSet.
de: Alle Ressourcen in diesem ResourceSet löschen.

# Delete.Title
source: Delete all resources for this resource id.
de: Alle Ressourcen löschen für diese Ressource Id.

# DynamicClasses
source: Dynamic Classes (Db or Resx)
de: Dynamische Klassen (Db oder Resx )

source: Edit
de: Bearbeiten

source: Enable Resource Editing
de: Ressourcen Bearbeitung aktivieren

# FeatureNotSupported
source: This feature is not supported in this live online demo application.
de: Diese Funktion ist nicht unterstützt in dieser Online-Demo -Anwendung.

source: Filename
de: Datei

source: File Resource Upload
de: Dateien Ressource hochladen

source: Folder
de: Ordner

source: From
de: Von

# GridView
source: Grid
de: Tabelle

# GridView_Title
source: Edit resources for the active ResourceSet in a grid where all resource for all locales are visible and very quickly editable.
de: Bearbeiten von Ressourcen für den aktivierten ResourceSet in einem Grid, in dem alle Ressourcen für alle Lokale sichtbar sind und sehr schnell bearbeitet werden können.

source: Hello World!
de: Hallo Welt!

# Home.Title
source: Back to site home.
de: Zurück zur Startseite der Website.

# ImportExportResx
source: Import or Export Resx
de: Resx Import Export

# ImportExportResx.Title
source: Import or export resources to and from Resx file(s).
de: Ressourcen aus Resx dateien importieren or exportieren.

source: Import or Export Resx Resources
de: Resx Ressourcen Importieren oder Exportieren

source: Import Resx
de: Resx Importieren

# ImportResx.Title
source: Import resources from Resx files.
de: Ressourcen aus Resx-Dateien importieren.

source: Invalid Resource Id.
de: Ungültige Ressourcen-ID.

source: Lang
de: Sprache

source: Locale Ids failed to load.
de: Locale-IDs konnten nicht geladen werden.

source: Localization Administration
de: Lokalisierungs Verwaltung

source: Localization table has been created.
de: Lokalisierungs Tabelle wurde angelegt.

# LocalizationTableNotCreated
source: Localization table has not been created.
de: Lokalisierungs Tabelle konnte nicht erstellt werden.

# NoProviderConfigured
source: No Provider configured (Resx)
de: Kein Provider konfiguriert (Resx)

source: No resource passed to add or update.
de: Keine Ressourcen zugeführt, um hinzuzufügen oder zu aktualisieren.

source: Refresh
de: Aktualisieren

source: Reload Resources
de: Ressourcen neu laden

# ReloadResources.Title
source: Force database resources to be reloaded so that next server hit refreshes all resources to latest changes. You have to reload the page to see the resource changes.
de: Datenbank Ressourcen werden neu geladen, so dass der nächste Server-Hit alle Ressourcen mit Änderungen aktualisiert. Sie muessen die Seite ernneuern um die Änderungen zu sehen.

source: Rename
de: Umbenennen

# Rename.Title
source: Rename all resources for this resource id.
de: Alle Ressourcen für diese Ressource-ID umbennen.

source: Resource Editor
de: Ressourcen Bearbeitung

source: Resource generation failed.
de: Ressourcengenerierung fehlgeschlagen.

source: Resource import failed.
de: Ressourcen import hat fehlgeschlagen.

source: Resource Provider Info
de: Ressourcen-Provider Info

source: Resources
de: Ressourcen

# ResourceSaved
source: Resource has been saved.
de: Ressource wurde gespeichert.

# ResourceSetLoadingFailed
source: Resourceset failed to load.
de: ResourceSet konnte nicht geladen werden.

source: ResourceSet renamed.
de: ResourceSet umbenannt.

source: ResourceSets to export
de: ResourceSets zu exportieren

source: Resources have been backed up.
de: Ressourcen wurden gesichert.

source: Resources have been reloaded.
de: Ressourcen wurden neu geladen.

source: Resource update failed.
de: Ressourcen konnte nicht aktualisiert werden.

source: Resx Designer Classes
de: Resx Designer Klassen

# ResxExportInfo
source: The resource export will export all resources to the specified resource folder below.
de: Der Ressourcen-Export exportiert alle Ressourcen auf den angegebenen Ressource Ordner.

# ResxExportInfo.Project
source: Your Resx Export Mode is <b>Project</b>, so resource files are created in this folder as seperate .resx files, one per resource set.
de: Ihr Resx Exportmodus ist <b>Projekt</ b>, und so werden Ressourcendateien diesem Ordner als separate RESX-Dateien erstellt, eine für jeden ResourceSet.

# ResxImportInfo
source: The resource import will import all .Resx resources from the specified resource folder below recursively.
de: Der Ressourcen-Import wird alle Resx Ressourcen aus dem angegebenen Ressourcen Ordner rekursiv importieren.

# ResxImportInfo.Project
source: Your Resx Export Mode is <b>Project</b>, so resource files are imported hierarically with paths prefixed using web based path syntax that is reflected in the resource set name.
de: Ihr Resx Exportmodus ist <b>Projekt</ b>, also werden ihre Ressourcendateien recursiv mit Pfaden und Web-basierter Pfadsyntax importiert, die sich in dem RessourceSet Namen widerspiegelt.

# ResxImportInfo.WebForms
source: Your Resx Export Mode is <b>WebForms</b>, so .Resx resources are imported from the appropriate App_GlobalResources and App_LocalResources folders. Loose .Resx files are also imported. Global resources are mapped without a path, local resources contain the relative path and local resource control page/control they map.
de: Ihr Resx Exportmodus ist <b> WebForms </ b>, also werden RESX-Ressourcen aus den entsprechenden App_GlobalResources und App_LocalResources Ordner importiert.

# ResxResourcesHaveBeenCreated
source: Resx Resources have been created in your Web project.
de: Resx Ressourcen sind in Ihrem Web-Projekt erstellt worden.

source: Resx Resources have been imported.
de: Resx Ressourcen wurden importiert.

source: Save
de: Speichern

# SaveResource
source: Save resource (Ctrl-Enter)
de: Resource speichern (Ctrl-Enter)

source: Search Resources
de: Ressourcen durchsuchen

# StronglyTypedClassCreated
source: Strongly typed classes have been created. You'll have to re-compile your application to use any added resources.
de: Stark typisierte Klassen wurden erstellt. Sie müssen in Ihrer Anwendung zusätzliche Ressourcen neu kompilieren.

# StronglyTypedGlobalResourcesFailed
source: Failed to create strongly typed resources.
de: Fehler bei der stark typisierte Ressourcen Erstellung.

source: Text to translate
de: Text zu übersetzen

source: To
de: Zu

source: Translate
de: Übersetzen

source: Translate Resource
de: Resource Übersetzung

source: Translation
de: Übersetzung

source: Use
de: Anwenden

source: You are about to delete this resource set.
de: Sie sind dabei diesen RessourceSet zu löschen.
