Repository: RickStrahl/Westwind.Globalization
Catalog: Westwind.Globalization.Sample/App_LocalResources/Cultures.aspx.*.resx
Languages: de

# btnRefresh.Text
source: Refresh Page
de: Seite erneuern

# btnReload.Text
source: Reload Page
de: Voll Erneuern

# lblLanguageNoteHeader.Text
source: UI Culture has been changed
de: Die Sprach Stellung wurde verändert

# lblLanguageNote.Text
source: UICulture Language Translation won't show up until your refresh this page after selection. This is due to the event order. In normal situations you'd just Redirect() to a new page, but here we want to maintain the page state, which gets complicated very quickly when switching cultures on the fly (see code). <br/><br/> This dialog is a workaround that forces a refresh with all POST data intact.
de: Sprach Übersetzung geht nicht bis diese Seite noch einmal erneuert wird nach der Sprach Wahl. Normalerweise kann man Response.Redirect benutzen, aber hier muss die Seite auch die POST Daten schicken um die Seite richtig zu erstellen. <br/><br/> Dieses Fenster erneuert die Seite richtig.

# btnRefreshLanguage.Text
source: Refresh now
de: Erneuern

# ListItem1.Text
source: Map to Browser Culture
de: Browser Sprach Anwendung

# ListItem2.Text
source: Language Selection
de: Manuelle Sprach Wahl

# ListItem.Text
source: Default Culture
de: Normal Kultur Anwendung

# ListItemResource3.Text
source: German
de: Deutsch

# ListItemResource4.Text
source: French
de: Französich

# ListItemResource1.Text
source: Default
de: Automatisch

# lblSelectLanguageResource1.Text
source: Select Language:
de: Sprache wählen:

# lblGeneratedAt.Text
source: Generated on:
de: Erzeugt am:

# lblCurrency.Text
source: Currency Value:
de: Geld Wert:

# lblBrowserLanguage.Text
source: Browser Language:
de: Sprache:

# chkSetLocale.Text
source: Enable Locale Mapping
de: Lokal automatisch erkennen

# lblDateTime.Text
source: Date Time:
de: Zeit:

# lblNumeric.Text
source: Numeric Value:
de: Nummer:

# lblPageHeader.Text
source: Thread Culture Mapping
de: Kultur Wahl

# lnkHome.Text
source: Back to Home Page
de: Zurück

# Page1.Title
source: Thread Cultures
de: Kulturen
