Repository: RickStrahl/Westwind.Globalization
Catalog: Westwind.Globalization.Sample/App_LocalResources/Customerlist.aspx.*.resx
Languages: de

# lblAddress.Text
source: Address:
de: Ihre Addresse:

# BoundField.HeaderText
source: Entered
de: Eingetragen

# BoundField1.HeaderText
source: Order Number
de: Auftragsnummer

# BoundField2.HeaderText
source: Order Total
de: Auftrag Gesamtmenge

# btnSave.Text
source: Save Customer
de: Kunden speichern

# TotalForInvoices
source: Total for all Invoices:
de: Gesamt für alle Rechnungen:

# lblPageHeader.Text
source: Northwind Localizable Customer with Ajax Admin
de: Northwind Kunden Liste

# lblRegion.Text
source: Region:
de: Ihre Region:

# lblPostalCode.Text
source: Postal Code:
de: Postleitzahl:

# lblEntered.Text
source: Entered:
de: Eingetragen:

# lnkPageRefresh.Text
source: Reset Page
de: Seite erneuern

# lnkHome.Text
source: Home
de: Start Seite

# lblPageCreated.Text
source: Page created:
de: Seite erstellt:

# Page1.Title
source: Northwind Customer List using ATLAS
de: Northwind Kunden Liste

# lblCompany.Text
source: Company:
de: Ihre Firma:

# lblName.Text
source: Name:
de: Ihr Name:

# lblCity.Text
source: City:
de: Ihre Stadt:

# btnRefresh.Text
source: Refresh List
de: Liste erneuern

# txtResSearch.Text
source: Search Resource Ids (Alt-E)
de: Resource Ids durchsuchen (Alt-E)

# lblDialogTitle.Text
source: Customer List
de: Kunden Liste:

# lblValue.Text
source: Translated Text:
de: Übersetzter Text:

# PleaseSelectTwoSeparateLanguages
source: Please select two separate languages to translate
de: Bitte waehlen Sie zwei verschiedene Sprachen

# ResourceImportComplete
source: Resource import completed
de: Resourcen wurden erfolgreich eingührt

# lblCountry.Text
source: Country:
de: Ihr Land:
